app/controllers/boxfile_controller.rb

UPDATE "users" SET "folder" = ?, "updated_at" = ? WHERE "users"."id" = 1  [["folder", "KgPLoKLK"], ["updated_at", Wed, 03 Dec 2014 01:10:31 UTC +00:00]]
---
    def index
        if current_user.folder.nil?
            current_user.folder = generate_random_user_folder_name
            current_user.save